export const list = [
  {"id": "A", "name": "A"}, {"id": "1", "name": "奥迪"}, {"id": "2440", "name": "AITO"}, {
    "id": "1721",
    "name": "ARCFOX极狐"
  }, {"id": "536", "name": "ALPINA"}, {"id": "3", "name": "阿尔法·罗密欧"}, {"id": "2", "name": "阿斯顿·马丁"}, {
    "id": "2931",
    "name": "阿维塔"
  }, {"id": "1407", "name": "爱驰"}, {"id": "610", "name": "安凯客车"}, {"id": "B", "name": "B"}, {
    "id": "7",
    "name": "宝马"
  }, {"id": "15", "name": "宝骏"}, {"id": "172", "name": "宝沃"}, {"id": "144", "name": "宝龙"}, {
    "id": "5",
    "name": "本田"
  }, {"id": "9", "name": "奔驰"}, {"id": "12", "name": "奔腾"}, {"id": "6", "name": "别克"}, {
    "id": "8",
    "name": "比亚迪"
  }, {"id": "499", "name": "比速"}, {"id": "853", "name": "比德文汽车"}, {"id": "11", "name": "保时捷"}, {
    "id": "20",
    "name": "保斐利"
  }, {"id": "10", "name": "标致"}, {"id": "17", "name": "北汽威旺"}, {"id": "156", "name": "北汽幻速"}, {
    "id": "167",
    "name": "北汽新能源"
  }, {"id": "14", "name": "北汽制造"}, {"id": "2398", "name": "北汽瑞翔"}, {"id": "573", "name": "北汽道达"}, {
    "id": "13",
    "name": "北京汽车"
  }, {"id": "837", "name": "北京清行"}, {"id": "115", "name": "BEIJING汽车"}, {"id": "16", "name": "宾利"}, {
    "id": "19",
    "name": "巴博斯"
  }, {"id": "18", "name": "布加迪"}, {"id": "2432", "name": "百智新能源"}, {"id": "654", "name": "铂驰"}, {
    "id": "C",
    "name": "C"
  }, {"id": "21", "name": "长安"}, {"id": "23", "name": "长安凯程"}, {"id": "637", "name": "长安欧尚"}, {
    "id": "3040",
    "name": "长安跨越"
  }, {"id": "22", "name": "长城"}, {"id": "24", "name": "昌河"}, {"id": "1768", "name": "创维汽车"}, {
    "id": "497",
    "name": "成功"
  }, {"id": "3008", "name": "曹操汽车"}, {"id": "2983", "name": "橙仕"}, {"id": "D", "name": "D"}, {
    "id": "25",
    "name": "大众"
  }, {"id": "639", "name": "大乘汽车"}, {"id": "1705", "name": "大运"}, {"id": "142", "name": "大迪"}, {
    "id": "26",
    "name": "东风风行"
  }, {"id": "30", "name": "东风风神"}, {"id": "170", "name": "东风风光"}, {"id": "33", "name": "东风"}, {
    "id": "28",
    "name": "东风小康"
  }, {"id": "32", "name": "东风风度"}, {"id": "620", "name": "东风瑞泰特"}, {"id": "27", "name": "东南"}, {
    "id": "31",
    "name": "DS"
  }, {"id": "29", "name": "道奇"}, {"id": "2399", "name": "电动屋"}, {"id": "574", "name": "电咖"}, {
    "id": "662",
    "name": "达契亚"
  }, {"id": "F", "name": "F"}, {"id": "36", "name": "丰田"}, {"id": "35", "name": "福特"}, {
    "id": "39",
    "name": "福田"
  }, {"id": "545", "name": "福田乘用车"}, {"id": "162", "name": "福汽启腾"}, {"id": "40", "name": "福迪"}, {
    "id": "37",
    "name": "菲亚特"
  }, {"id": "42", "name": "菲斯克"}, {"id": "38", "name": "法拉利"}, {"id": "2314", "name": "飞凡汽车"}, {
    "id": "543",
    "name": "飞碟"
  }, {"id": "41", "name": "飞驰商务车"}, {"id": "147", "name": "富奇"}, {"id": "G", "name": "G"}, {
    "id": "44",
    "name": "广汽传祺"
  }, {"id": "2686", "name": "广汽埃安"}, {"id": "636", "name": "广汽集团"}, {"id": "45", "name": "广汽吉奥"}, {
    "id": "46",
    "name": "观致"
  }, {"id": "1772", "name": "高合汽车"}, {"id": "47", "name": "GMC"}, {"id": "586", "name": "国金"}, {
    "id": "1075",
    "name": "国机智骏"
  }, {"id": "48", "name": "光冈"}, {"id": "H", "name": "H"}, {"id": "50", "name": "哈弗"}, {
    "id": "56",
    "name": "哈飞"
  }, {"id": "53", "name": "红旗"}, {"id": "618", "name": "红星汽车"}, {"id": "51", "name": "海马"}, {
    "id": "54",
    "name": "海马商用车"
  }, {"id": "57", "name": "海格"}, {"id": "52", "name": "华泰"}, {"id": "173", "name": "华泰新能源"}, {
    "id": "2385",
    "name": "华晨新日"
  }, {"id": "160", "name": "华颂"}, {"id": "560", "name": "华骐"}, {"id": "3023", "name": "华夏领舰"}, {
    "id": "146",
    "name": "华普"
  }, {"id": "2937", "name": "华梓汽车"}, {"id": "495", "name": "汉腾"}, {"id": "1300", "name": "汉龙汽车"}, {
    "id": "55",
    "name": "黄海"
  }, {"id": "1703", "name": "HYCAN合创"}, {"id": "2918", "name": "恒驰"}, {"id": "58", "name": "恒天"}, {
    "id": "2386",
    "name": "恒润汽车"
  }, {"id": "145", "name": "悍马"}, {"id": "2363", "name": "宏瑞汽车"}, {"id": "59", "name": "汇众"}, {
    "id": "2094",
    "name": "航天凌河"
  }, {"id": "668", "name": "霍顿"}, {"id": "2279", "name": "黑豹"}, {"id": "J", "name": "J"}, {
    "id": "143",
    "name": "吉利"
  }, {"id": "63", "name": "吉利帝豪"}, {"id": "65", "name": "吉利英伦"}, {"id": "62", "name": "吉利全球鹰"}, {
    "id": "3026",
    "name": "吉利银河"
  }, {"id": "64", "name": "捷豹"}, {"id": "634", "name": "捷途汽车"}, {"id": "852", "name": "捷达"}, {
    "id": "2367",
    "name": "捷尼赛思"
  }, {"id": "61", "name": "Jeep"}, {"id": "60", "name": "江淮"}, {"id": "3021", "name": "江淮钇为"}, {
    "id": "66",
    "name": "江铃"
  }, {"id": "542", "name": "江铃集团新能源"}, {"id": "68", "name": "江南"}, {"id": "67", "name": "金杯"}, {
    "id": "69",
    "name": "金龙联合"
  }, {"id": "71", "name": "金旅客车"}, {"id": "3071", "name": "金琥新能源"}, {"id": "2366", "name": "极氪"}, {
    "id": "2989",
    "name": "极越"
  }, {"id": "3073", "name": "极石"}, {"id": "825", "name": "几何汽车"}, {"id": "70", "name": "九龙"}, {
    "id": "572",
    "name": "君马汽车"
  }, {"id": "817", "name": "巨威"}, {"id": "752", "name": "钧天"}, {"id": "K", "name": "K"}, {
    "id": "73",
    "name": "凯迪拉克"
  }, {"id": "157", "name": "凯翼"}, {"id": "678", "name": "凯佰赫"}, {"id": "819", "name": "凯马"}, {
    "id": "74",
    "name": "克莱斯勒"
  }, {"id": "2662", "name": "克蒂汽车"}, {"id": "75", "name": "开瑞"}, {"id": "562", "name": "卡升"}, {
    "id": "158",
    "name": "卡威"
  }, {"id": "77", "name": "卡尔森"}, {"id": "1720", "name": "Karma"}, {"id": "552", "name": "KTM"}, {
    "id": "546",
    "name": "康迪全球鹰"
  }, {"id": "76", "name": "科尼赛克"}, {"id": "L", "name": "L"}, {"id": "80", "name": "雷克萨斯"}, {
    "id": "84",
    "name": "雷诺"
  }, {"id": "640", "name": "雷丁"}, {"id": "2990", "name": "雷达汽车"}, {"id": "79", "name": "路虎"}, {
    "id": "90",
    "name": "路特斯"
  }, {"id": "561", "name": "领克"}, {"id": "682", "name": "领途汽车"}, {"id": "78", "name": "铃木"}, {
    "id": "87",
    "name": "林肯"
  }, {"id": "815", "name": "理想"}, {"id": "89", "name": "理念"}, {"id": "85", "name": "猎豹"}, {
    "id": "2365",
    "name": "岚图汽车"
  }, {"id": "750", "name": "零跑汽车"}, {"id": "83", "name": "陆风"}, {"id": "619", "name": "陆地方舟"}, {
    "id": "81",
    "name": "力帆"
  }, {"id": "86", "name": "劳斯莱斯"}, {"id": "82", "name": "兰博基尼"}, {"id": "1718", "name": "凌宝汽车"}, {
    "id": "88",
    "name": "莲花"
  }, {"id": "587", "name": "LITE"}, {"id": "661", "name": "Lorinser"}, {
    "id": "553",
    "name": "LOCAL MOTORS"
  }, {"id": "2402", "name": "LEVC"}, {"id": "2672", "name": "LUMMA"}, {"id": "3009", "name": "蓝电"}, {
    "id": "588",
    "name": "拉达LADA"
  }, {"id": "712", "name": "罗夫哈特"}, {"id": "M", "name": "M"}, {"id": "92", "name": "马自达"}, {
    "id": "93",
    "name": "名爵"
  }, {"id": "94", "name": "MINI"}, {"id": "96", "name": "玛莎拉蒂"}, {"id": "97", "name": "迈凯伦"}, {
    "id": "95",
    "name": "迈巴赫"
  }, {"id": "1298", "name": "迈迈"}, {"id": "641", "name": "迈迪汽车"}, {"id": "98", "name": "摩根"}, {
    "id": "2384",
    "name": "摩登汽车"
  }, {"id": "2936", "name": "敏安汽车"}, {"id": "558", "name": "明君汽车"}, {"id": "3072", "name": "猛士科技"}, {
    "id": "99",
    "name": "美亚"
  }, {"id": "N", "name": "N"}, {"id": "713", "name": "哪吒汽车"}, {"id": "100", "name": "纳智捷"}, {
    "id": "836",
    "name": "NEVS国能汽车"
  }, {"id": "O", "name": "O"}, {"id": "635", "name": "欧拉"}, {"id": "102", "name": "欧宝"}, {
    "id": "103",
    "name": "欧朗"
  }, {"id": "101", "name": "讴歌"}, {"id": "P", "name": "P"}, {"id": "716", "name": "Polestar"}, {
    "id": "679",
    "name": "Pgo"
  }, {"id": "503", "name": "帕加尼"}, {"id": "Q", "name": "Q"}, {"id": "104", "name": "起亚"}, {
    "id": "105",
    "name": "奇瑞"
  }, {"id": "106", "name": "启辰"}, {"id": "107", "name": "庆铃"}, {"id": "2974", "name": "骐铃汽车"}, {
    "id": "624",
    "name": "乔治·巴顿"
  }, {"id": "632", "name": "前途汽车"}, {"id": "R", "name": "R"}, {"id": "108", "name": "日产"}, {
    "id": "109",
    "name": "荣威"
  }, {"id": "631", "name": "瑞驰新能源"}, {"id": "110", "name": "瑞麒"}, {"id": "1704", "name": "睿蓝汽车"}, {
    "id": "570",
    "name": "如虎"
  }, {"id": "S", "name": "S"}, {"id": "112", "name": "斯柯达"}, {"id": "113", "name": "斯巴鲁"}, {
    "id": "498",
    "name": "斯威"
  }, {"id": "644", "name": "斯达泰克"}, {"id": "111", "name": "三菱"}, {"id": "34", "name": "上汽MAXUS"}, {
    "id": "116",
    "name": "Smart"
  }, {"id": "1689", "name": "SERES赛力斯"}, {"id": "2368", "name": "SS DOLPHIN"}, {"id": "1301", "name": "思皓"}, {
    "id": "169",
    "name": "思铭"
  }, {"id": "2924", "name": "深蓝汽车"}, {"id": "114", "name": "双龙"}, {"id": "117", "name": "双环"}, {
    "id": "149",
    "name": "萨博"
  }, {"id": "501", "name": "陕汽通家"}, {"id": "118", "name": "世爵"}, {"id": "3000", "name": "沙龙汽车"}, {
    "id": "500",
    "name": "赛麟"
  }, {"id": "1715", "name": "速达汽车"}, {"id": "T", "name": "T"}, {"id": "120", "name": "特斯拉"}, {
    "id": "2414",
    "name": "坦克"
  }, {"id": "166", "name": "腾势"}, {"id": "816", "name": "天际汽车"}, {"id": "150", "name": "天马"}, {
    "id": "119",
    "name": "泰赫雅特"
  }, {"id": "W", "name": "W"}, {"id": "121", "name": "五菱"}, {"id": "163", "name": "五十铃"}, {
    "id": "122",
    "name": "沃尔沃"
  }, {"id": "544", "name": "WEY"}, {"id": "571", "name": "蔚来"}, {"id": "617", "name": "威马汽车"}, {
    "id": "124",
    "name": "威兹曼"
  }, {"id": "123", "name": "威麟"}, {"id": "652", "name": "万丰"}, {"id": "2976", "name": "万象汽车"}, {
    "id": "3016",
    "name": "未奥汽车"
  }, {"id": "616", "name": "瓦滋汽车"}, {"id": "X", "name": "X"}, {"id": "125", "name": "现代"}, {
    "id": "126",
    "name": "雪佛兰"
  }, {"id": "127", "name": "雪铁龙"}, {"id": "717", "name": "小鹏汽车"}, {"id": "751", "name": "星途"}, {
    "id": "155",
    "name": "夏利"
  }, {"id": "564", "name": "鑫源"}, {"id": "2394", "name": "新吉奥"}, {"id": "638", "name": "新特汽车"}, {
    "id": "130",
    "name": "新凯"
  }, {"id": "151", "name": "新大地"}, {"id": "148", "name": "新雅途"}, {"id": "128", "name": "西雅特"}, {
    "id": "Y",
    "name": "Y"
  }, {"id": "132", "name": "英菲尼迪"}, {"id": "159", "name": "英致"}, {"id": "131", "name": "一汽"}, {
    "id": "615",
    "name": "一汽红塔"
  }, {"id": "135", "name": "依维柯"}, {"id": "133", "name": "野马"}, {"id": "838", "name": "远程汽车"}, {
    "id": "3013",
    "name": "远航汽车"
  }, {"id": "565", "name": "云度新能源"}, {"id": "568", "name": "云雀"}, {"id": "547", "name": "御捷新能源"}, {
    "id": "681",
    "name": "亚特汽车"
  }, {"id": "643", "name": "宇通客车"}, {"id": "136", "name": "扬州亚星客车"}, {"id": "134", "name": "永源"}, {
    "id": "563",
    "name": "裕路"
  }, {"id": "824", "name": "银隆新能源"}, {"id": "Z", "name": "Z"}, {"id": "138", "name": "众泰"}, {
    "id": "137",
    "name": "中华"
  }, {"id": "139", "name": "中兴"}, {"id": "1076", "name": "中国重汽VGV"}, {"id": "140", "name": "中欧"}, {
    "id": "152",
    "name": "中客华北"
  }, {"id": "660", "name": "中誉"}, {"id": "141", "name": "中通客车"}, {"id": "154", "name": "中顺"}, {
    "id": "168",
    "name": "知豆"
  }, {"id": "2671", "name": "智己汽车"}, {"id": "569", "name": "之诺"}, {"id": "653", "name": "宗申"}, {
    "id": "2966",
    "name": "自游家"
  }]